
var cars=new Array();
cars[0]="00:00";
cars[1] ="作词 : 畑亜貴";
cars[2]="00:00";
cars[3]="作曲 : 田中秀和";
cars[4]="00:00";
cars[5]="编曲 : 田中秀和";
cars[6]="00:01";
cars[7]="我々（うー！）寄れ依れ！（にゃー！）";
cars[8]="00:02";
cars[9]="世界はDark!（こずみっく！）";
cars[10]="00:04";
cars[11]="（うー！にゃー！うー！にゃー！うー！にゃー！レッツにゃー！）";
cars[12]="00:11";
cars[13]="心ぬるぬる異形の神々";
cars[14]="00:14";
cars[15]="私もあなたも怖がりの物ずき";
cars[16]="00:17";
cars[17]="形むるむる異教徒逃げれば";
cars[18]="00:21";
cars[19]="私とあなたは炎天下でおデート";
cars[20]="00:24";
cars[21]="た の し い ね 焼けるぞ溶けるぞ";
cars[22]="00:29";
cars[23]="（生き物じゃなーい）";
cars[24]="00:30";
cars[25]="骸（むくろ）ひやひや其れでも好きです";
cars[26]="00:34";
cars[27]="私がいちばん欲しいのは内緒よ"
cars[28]="00:37";
cars[29]="姿ぱやぱや其れでは行きましょ";
cars[30]="00:41";
cars[31]="私にいちばん似合うかな不条理";
cars[32]="00:44";
cars[33]="鏡には（だん だん 誰なの？）";
cars[34]="00:47";
cars[35]="うつらない（誰なんだ？やだやだ）";
cars[36]="00:51";
cars[37]="欲望は言葉にしなくちゃ（うー！）";
cars[38]="00:55";
cars[39]="ほら（にゃー！）、消えちゃうでしょう？（レッツにゃー！）";
cars[40]="00:57";
cars[41]="太陽なんか眩しくって";
cars[42]="01:01";
cars[43]="闇のほうが無限です（どきどき）";
cars[44]="01:04";
cars[45]="太陽ばっか眩しくって";
cars[46]="01:07";
cars[47]="闇のほうがす・て・き（にゃんだ～？）";
cars[48]="01:11";
cars[49]="CHAOS（けいおす）CHAOS I wanna CHAOS";
cars[50]="01:14";
cars[51]="燃えよ混沌 無敵です（わくわく）";
cars[52]="01:17";
cars[53]="CHAOS CHAOS una sera CHAOS";
cars[54]="01:21";
cars[55]="燃えるようなき・も・ち（にゃんで～？）";
cars[56]="01:24";
cars[57]="我々！（うー！）遣れ破れ！（にゃー！）";
cars[58]="01:26";
cars[59]="世界はDark!（こずみっく！）";
cars[60]="01:27";
cars[61]="（うー！にゃー！うー！にゃー！うー！にゃー！レッツにゃー！）";
cars[62]="01:34";
cars[63]="枕ぽかぽか無貌（むぼう）の神々";
cars[64]="01:38";
cars[65]="私とあなたと目的は違うの";
cars[66]="01:41";
cars[67]="絆むかむか無理矢理されがち";
cars[68]="01:44";
cars[69]="わたしがあなたを守るけどおピンチ";
cars[70]="01:47";
cars[71]="お か し い な 逃げるぞ呻くぞ";
cars[72]="01:53";
cars[73]="（狙われてるーぅ）";
cars[74]="01:54";
cars[75]="帳（とばり）おりおり此所まで来ました";
cars[76]="01:58";
cars[77]="私はだまって敵たちを蹴散らす";
cars[78]="02:01";
cars[79]="焔（ほむら）めらめら此所では駄目です";
cars[80]="02:04";
cars[81]="私にだまってスカウトはしないで";
cars[82]="02:08";
cars[83]="望むなら（ぜん ぜん 全滅！）";
cars[84]="02:11";
cars[85]="しましょうね（敵なんだ？やれやれ）";
cars[86]="02:14";
cars[87]="願わくば跡形もなくね（うー！）";
cars[88]="02:18";
cars[89]="あら（にゃー！）、要らないでしょう？（レッツにゃー！）";
cars[90]="02:21";
cars[91]="現在なんと危険だった";
cars[92]="02:24";
cars[93]="光もんを下さい（ぴかぴか）";
cars[94]="02:28";
cars[95]="現在なんと危険だった";
cars[96]="02:31";
cars[97]="光もんでし・げ・き（にゃるビーム？）";
cars[98]="02:34";
cars[99]="MADNESS MADNESS You wanna MADNESS";
cars[100]="02:38";
cars[101]="呼べば冒涜 過激です（ぞくぞく）";
cars[102]="02:41";
cars[103]="MADNESS MADNESS ennui MADNESS";
cars[104]="02:45";
cars[105]="呼べばきっとお・し・まい（にゃんです！）";
cars[106]="02:48";
cars[107]="這いよる！（うー！）混沌！（にゃー！）";
cars[108]="02:50";
cars[109]="ニャルラトホ！（てっぷー！）";
cars[110]="02:52";
cars[111]="太陽曰く燃えよカオス";
cars[112]="02:54";
cars[113]="TVアニメ「這いよれ！ニャル子さん」OP";
cars[114]="02:56";
cars[115]="作詞：畑亜貴";
cars[116]="02:57";
cars[117]="作曲/編曲：田中秀和(MONACA)";
cars[118]="02:59";
cars[119]="歌：後ろから這いより隊G（ニャル子（阿澄佳奈）";
cars[120]="03:00";
cars[121]="×クー子(松来未祐)×珠緒(大坪由佳)）";
cars[122]="03:05";
cars[123]="（うー！にゃー！うー！にゃー！うー！にゃー！";
cars[124]="03:10";
cars[125]="うー！にゃー！うー！にゃー！うー！にゃー！";
cars[126]="03:15";
cars[127]="うー！にゃー！レッツにゃー！）";
cars[128]="03:18";
cars[129]="太陽なんか眩しくって";
cars[130]="03:22";
cars[131]="闇のほうが無限です（どきどき）";
cars[132]="03:25";
cars[133]="太陽ばっか眩しくって";
cars[134]="03:28";
cars[135]="闇のほうがす・て・き（にゃんだ～？）";
cars[136]="03:32";
cars[137]="CHAOS（けいおす）CHAOS I wanna CHAOS";
cars[138]="03:35";
cars[139]="燃えよ混沌 無敵です（わくわく）";
cars[140]="03:38";
cars[141]="CHAOS CHAOS una sera CHAOS";
cars[142]="03:42";
cars[143]="燃えるようなき・も・ち（にゃんで～？）";
cars[144]="03:45";
cars[145]="這いよる！（うー！）混沌！（にゃー！）";
cars[146]="03:47";
cars[147]="ニャルラトホ！（てっぷー！）";
cars[148]="03:52";
cars[149]="～END～";



bmusic=document.getElementById('audio');

 var v=0;
 function gce(sup){
 
var so=setInterval(function(){ 
var musicname=localStorage.music;
switch(musicname)
{

        case "8":
    mu();
        break;
        default:

    break;
        }

    }, 1000);

}
function mu(){

var b=Math.trunc(bmusic.currentTime+0.3);
if(b>60){
var tm=Math.trunc(b/60);
var ta=tm*60;
var tc=b-ta;
if(tm<=9){
var tm="0"+tm;
}
if(tc<=9){
var tc="0"+tc;
}
var t=tm+":"+tc;


}else{
if(b>9){
var t="00:"+b;
}else{
var t="00:0"+b;
}
}

for(var c=0;c<=149;c++){
if(cars[v]==t){
v=v+1;
document.getElementById("musicp").innerHTML=cars[v];
break;
}else{
v=c;

}
}
}

